<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
<TITLE>mendelson AS2 Server &Uuml;bersicht</TITLE>
<link rel="stylesheet" href="../../doc/mec_HTMLdoc.css">
</HEAD>
<h2>Schl&uuml;ssel und Zertifikate</h2>
<hr>
<h3><a href="#msgencryption">Signatur und Verschl&uuml;sselung von Nachrichten</a></h3>
<h3><a href="#transportencryption">Verschl&uuml;sselung des &Uuml;bertragungsweges 
  (https)</a></h3>
<h3>&nbsp;</h3>
<P>Das AS2 Protokoll erlaubt eine verschl&uuml;sselte Verbindung von Daten 
  &uuml;ber das Internet. Zudem lassen sich die Nachrichten signieren und ebenfalls 
  verschl&uuml;sseln. Daher ist es wichtig, entsprechende Schl&uuml;ssel vorzuhalten.</P>
<p>Dazu ist eine Schl&uuml;sselverwaltung in die AS2 Server GUI integriert. 
  Die Terminologie der in der GUI bezeichnet einen &quot;Schl&uuml;ssel&quot; 
  als den private Schl&uuml;ssel oder ein Schl&uuml;sselpaar (privater und &ouml;ffentlicher 
  Schl&uuml;ssel), w&auml;hrend &quot;Zertifikat&quot; ein Zertifikat meint, in 
  das ein &ouml;ffentlicher Schl&uuml;ssel eines Partner eingebettet ist.</p>
<p>&nbsp;</p>
<h3><a name="msgencryption"></a>Signatur und Verschl&uuml;sselung von Nachrichten</h3>
<p>Der Sender einer Nachricht ben&ouml;tigt jeweils einen privaten Schl&uuml;ssel 
  f&uuml;r sich und einen &ouml;ffentlichen Schl&uuml;ssel seines Partners. <br>
  Eine Nachricht wird mit dem jeweiligen privaten Schl&uuml;ssel signiert, dieser 
  sollte sich daher nur im Besitz des jeweiligen Senders befinden. Der &ouml;ffentliche 
  Schl&uuml;ssel dient zur Verifikation einer Signatur. Der gleiche Mechanismus 
  funktioniert auch beim Verschl&uuml;sseln.<br>
</p>
<p>Die &ouml;ffentlichen Schl&uuml;ssel sind vor der &Uuml;bertragung entsprechend 
  auszutauschen. Um dem Partner seinen &ouml;ffentlichen Schl&uuml;ssel zu geben, 
  kann die Funktion &quot;Zertifikat exportieren&quot; in der GUI zum Verwalten 
  der Zertifikate benutzt werden. Um den &ouml;ffentlichen Schl&uuml;ssel (eingebettet 
  ins Zertifikat) seines Partners zu importieren, kann die Funktion &quot;Schl&uuml;ssel-Zertifikat 
  importieren&quot; benutzt werden.<br>
  Jeder Schl&uuml;ssel oder jedes Schl&uuml;sselpaar wird &uuml;ber einen Alias 
  adressiert, der beim Import zu vergeben ist. Bei den Partnerdefinitionen kann 
  dann jeweils dieser Alias ausgew&auml;hlt werden.<br>
  Bitte beachten Sie, dass die meisten Schl&uuml;ssel eine begrenzte G&uuml;ltigkeit 
  haben, das sollten Sie von Zeit zu Zeit &uuml;berpr&uuml;fen. Das Ablaufdatum 
  ist in der GUI zur Schl&uuml;sselverwaltung ersichtlich. Wenn ein Schl&uuml;ssel 
  abgelaufen ist, kann mit ihm nicht mehr gearbeitet werden, er ist ung&uuml;ltig.<br>
  Ein Nachrichtenaustausch kann nur signiert und/oder verschl&uuml;sselt stattfinden, 
  wenn beide beteiligten Parteien &uuml;ber die jeweils gleichen Zertifikate und 
  Schl&uuml;ssel verf&uuml;gen.</p>
<p>&nbsp;</p>
<h3><a name="transportencryption"></a>Verschl&uuml;sselung des &Uuml;bertragungsweges 
  (https)</h3>
<P>Der Http &Uuml;bertragungsweg wird gesondert verschl&uuml;sselt (ssl). Dazu 
  sind die entsprechenden Zertifikate zum Senden von Nachrichten in den Keystore 
  zu importieren, der in den Einstellungen des Servers angegeben ist. Ein Import 
  von Zertifikaten in diesen Keystore kann &uuml;ber das java Kommandozeilentool 
  &quot;keytool&quot; stattfinden. Sehr empfehlenswert ist jedoch ein Programm, 
  das direkt mit Keystores umgehen kann, wie zum Beispiel &quot;Portecle&quot; 
  (Open Source).<br>
  Der mendelson AS2 Server wird in der Regel mit einem Tomcat HTTP Server 
  ausgeliefert. Dieser ist schon so konfiguriert, dass unter tomcat/common der 
  Keystore tomcat.keystore mit dem Passwort &quot;changeit&quot; liegt, in den 
  die entsprechenden Clientzertifikate der Partner importiert werden k&ouml;nnen.<br>
  <br>
  Falls Sie diesen vorkonfigurierten Server nicht benutzen wollen, schauen Sie 
  bitte in die Dokumentation Ihres jeweiligen Servers, wie dort benutzerdefinierte 
  Clientzertifikate f&uuml;r Https einzubinden sind.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<hr>
<table width="100%" border="0">
  <tr> 
    <td><a href="http://www.mendelson.de"><img src="../../doc/images/mec_banner.gif" border="0"></a></td>
    <td class="date"><b>Last modified:</b> $Date: 3.04.06 11:19 $</td>
  </tr>
</table>
</BODY>

</HTML>